<?php

return [
    'root' => '根',
    
    /*
        |--------------------------------------------------------------------------
        | Buttons
        |--------------------------------------------------------------------------
    */
    'button.save' => '保存',
    'button.expand_all' => '全部展開',
    'button.collapse_all' => '全部折叠',

    /*
        |--------------------------------------------------------------------------
        | Form
        |--------------------------------------------------------------------------
    */
    'components.tree.buttons.select_all.label' => '選擇全部',
    'components.tree.buttons.deselect_all.label' => '取消全選',
    'components.tree.buttons.expand_all.label' => '全部展開',
    'components.tree.buttons.collapse_all.label' => '全部折叠',
    /*
        |--------------------------------------------------------------------------
        | Message
        |--------------------------------------------------------------------------
    */
    'actions.delete.confirmation.with_children' => '你確定要刪除這條記錄及其子記錄嗎？',
];