<?php

return [
    'root' => 'الرئيسي',

    /*
    |--------------------------------------------------------------------------
    | Buttons
    |--------------------------------------------------------------------------
    */
    'button.save' => 'حفظ',
    'button.expand_all' => 'توسيع الكل',
    'button.collapse_all' => 'طي الكل',

    /*
    |--------------------------------------------------------------------------
    | Form
    |--------------------------------------------------------------------------
    */
    'components.tree.buttons.select_all.label' => 'تحديد الكل',
    'components.tree.buttons.deselect_all.label' => 'إلغاء تحديد الكل',
    'components.tree.buttons.expand_all.label' => 'توسيع الكل',
    'components.tree.buttons.collapse_all.label' => 'طي الكل',

    /*
    |--------------------------------------------------------------------------
    | Message
    |--------------------------------------------------------------------------
    */
    'actions.delete.confirmation.with_children' => 'هل أنت متأكد أنك تريد حذف هذا العنصر وجميع العناصر الفرعية؟',
];
